package com.example.demo.domain.member.memberenums;

public enum MemberGradeLevel {

	백성,
    유생,         // 1: 신입
    급제자,		
    서리,         // 2: 하급 관리
    참군,         // 3: 초급 관리
    현감,         // 4: 중급 관리, 작은 고을 수령
    부사,         // 5: 고을 단위 책임자
    참판,         // 6: 중상급 관리
    암행어사,     // 7: 왕의 밀명을 받고 파견
    병조정랑,     // 8: 군사 부하직, 병조 참하급
    병조판서,     // 9: 군사 최고 관직
    좌참판,       // 10: 정승 후보급
    우의정,		// 11: 정승 3위
    좌의정,       // 12: 정승 2위
    영의정,       // 13: 정승 1위
    왕자,			
    세자,
    왕,
    관리자          // 16: 최고 관리자

}
